Repository: Oktopuce/site_generator
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: fr

# title_generator
source: New site generation (or tree model duplication)
fr: Génération d'un nouveau site (ou duplication d'une arborescence de pages)

# form.previousStep
source: Previous step
fr: Étape précédente

# form.nexStep
source: Next step
fr: Étape suivante

# form.FirstStepData.title
source: Mandatory informations
fr: Informations obligatoires

# form.FirstStepData.siteTitle
source: Site title (root page title)
fr: Titre du site (titre de la page racine)

# form.FirstStepData.selectModel
source: Select model
fr: Sélectionner le modèle

# form.SecondStepData.domain
source: Domain name (https://www.example.com/) - leave empty to ignore
fr: Nom de domaine (https://www.example.com/) - laisser vide pour ignorer

# form.SecondStepData.title
source: Optional Information
fr: Informations optionnelles

# form.SecondStepData.groupPrefix
source: Group prefix (BE and FE)
fr: Préfixe du groupe (BE et FE)

# form.SecondStepData.newFolderCreation
source: New folders will be created in fileadmin like : "baseFolderName > Titre du site > SubFolderName"
fr: De nouveaux dossiers seront créés dans fileadmin comme : "baseFolderName > Site Name > SubFolderName"

# form.SecondStepData.baseFolderName
source: Base folder name
fr: Nom du dossier de base

# form.SecondStepData.subFolderNames
source: Sub-folder names to create (comma separated)
fr: Nom des sous-dossiers (séparés par des virgules)

source: No model founded
fr: Aucun modèle trouvé

# checkModelPid
source: Check modelsPid in extension configuration
fr: Vérifier modelsPid dans la configuration de l'extension

# generate.success.copySuccessfull
source: - Model copy successful (pid model root page = %s)
fr: - Le modèle a été copié (pid de la page racine = %s)

# generate.success.feGroupCreated
source: - A new FE group has been created : %s (uid = %s)
fr: - Un nouveau groupe FE a été créé : %s (uid = %s)

# generate.success.beGroupCreated
source: - A new BE group has been created : %s (uid = %s)
fr: - Un nouveau groupe BE a été créé : %s (uid = %s)

# generate.success.noFeGroupCreated
source: - FE group couldn't be created because module.tx_sitegenerator.settings.siteGenerator.wizard.pidFeGroup (Cf TS constants) is not defined
fr: - Le group FE ne peut pas être créé car module.tx_sitegenerator.settings.siteGenerator.wizard.pidFeGroup (Cf constantes TS) n'est pas définie

# generate.success.folderExist
source: - Folder '%s' hasn't been created because it already exists
fr: - Le dossier '%s' n'a pas été crée car il existe déjà

# generate.success.folderCreated
source: - Folder '%s' has been created
fr: - Le dossier '%s' a été crée

# generate.success.feGroupSetToPages
source: - The FE group with uid %s has been set for pages : %s
fr: - Le groupe FE avec l'uid %s a été affecté aux pages : %s

# generate.success.beGroupSetToPages
source: - The BE group with uid %s has been set for pages : %s
fr: - Le groupe BE avec l'uid %s a été affecté aux pages : %s

# generate.success.homePageUpdated
source: - Home page title has been set to '%s'
fr: - Le titre de la page d'accueil est '%s'

# generate.success.updatePageTS
source: - Update page TSConfig (TCEMAIN.clearCacheCmd) done for pages : %s
fr: - La configuration de page (TCEMAIN.clearCacheCmd) a été mise à jour pour les pages : %s

# generate.success.createSiteConfiguration
source: - The site configuration for domain '%s' has been created
fr: - La configuration de site pour le domain '%s' a été réalisée

# generate.success.createFileMount
source: - A new file mount has been set : %s (uid = %d)
fr: - Un nouveau point de montage de fichier a été généré : %s (uid = %d)

# generate.success.templateHpUpdated
source: - Update home page template with new uids done
fr: - Le template de la page d'accueil a été mis à jour avec les nouveau identifiants (uid)

# generate.success
source: The new site creation/tree model duplication was finished.
fr: La création du nouveau site/duplication de l'arborescence de page est terminée.

# wizard.firstPage.error
source: The site first page couldn't be created.
fr: Impossible de créer la première page du site.

# wizard.createSiteConfiguration.error
source: The site configuration couldn't be created.
fr: Impossible de créer la configuration du site.

# wizard.createSiteConfiguration.error.noRooTPage
source: - The site configuration couldn't be created because model contains no root page.
fr: - Impossible de créer la configuration du site car le modèle ne contient pas de page racine.

# wizard.copyModel.error
source: Site model copy error.
fr: Erreur lors de la copie du site modèle.

# wizard.beGroup.error
source: Create BE group error.
fr: Erreur lors de la création du groupe BE.

# wizard.feGroup.error
source: Create FE group error - check TypoScript configuration for pidFeGroup.
fr: Erreur lors de la création du groupe FE - vérifier que la configuration TypoScript pour pidFeGroup.

# wizard.fileMount.error
source: Create file mount error.
fr: Erreur lors de la création du point de montage.

# wizard.folderCreation.error
source: Directory creation error for "%s".
fr: Erreur lors de la création du dossier "%s".

# wizard.tsError
source: TS configuration error for "%s".
fr: Erreur de configuration TS for "%s".
